UTILIDAD/FUENTES MICROS/MS LATINIA/utilitarioms-master/utilitarioms-master/xml/insertTicket.xml

<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:e="http://www.technisys.net/cmm/services/errors/v1.0"
  xmlns:md="http://www.technisys.net/cmm/services/metadata/v2.0"
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <SOAP-ENV:Header xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <md:metadata>
      <serviceId>insertTicket</serviceId>
        <traceNumber>${traceNumber}</traceNumber>  
      <serviceVersion>0.0</serviceVersion>
      <executingChannel> 
        <mnemonic>${mnemonic}</mnemonic> 
      </executingChannel>  
      <executingOperatorId>${executingOperatorId}</executingOperatorId>
      <featureId>ROL@6030</featureId>
      <terminalId/>  
      <locale>es_AR</locale>  
    </md:metadata>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <srv:insertTicketRequest xmlns:srv="http://www.technisys.net/cmm/services/insertTicket/rq/v0.0">
      <generic>
        <xmlMessage type="java.lang.String">
			${xmlMessage}
        </xmlMessage>
      </generic>
      <ticket name="ticket">
        <referenceNumber>${referenceNumber}</referenceNumber>
      </ticket>
    </srv:insertTicketRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>